Repository: Spacebody/Vela
Catalog: Vela/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# rules.inspector.pending.detailFormat
source: Current: %@ · Requested: %@ · Phase: %@
zh_hans: 当前：%1$@ · 请求：%2$@ · 阶段：%3$@

# rules.inspector.pending.title
source: Temporary Change in Progress
zh_hans: 正在应用临时更改

# rules.inspector.provenance.subtitle
source: Runtime source evidence
zh_hans: 运行时来源证据

# rules.inspector.provenance.title
source: Source and Provenance
zh_hans: 来源与溯源

# rules.inspector.provenance.unavailable.detail
source: Mihomo's runtime rules response does not expose source-layer or provider provenance. Vela does not infer it from display values.
zh_hans: Mihomo 的运行时规则响应未提供来源层或供应商信息。Vela 不会根据显示值推断来源。

# rules.inspector.runtimeRule.fallback
source: Runtime rule
zh_hans: 运行时规则

# rules.inspector.sourceUnknown
source: Source Unknown
zh_hans: 来源未知

# rules.inspector.statistics.subtitle
source: Temporary state may reset when configuration reloads
zh_hans: 重新载入配置时，临时状态可能会重置

# rules.inspector.statistics.title
source: Runtime Statistics
zh_hans: 运行时统计

# rules.inspector.temporary.current
source: Current Temporary State
zh_hans: 当前临时状态

# rules.inspector.temporary.resetWarning
source: Temporary — resets when the configuration reloads.
zh_hans: 临时状态——重新载入配置时会重置。

# rules.inspector.temporaryState.description
source: This change resets when Mihomo reloads the configuration.
zh_hans: Mihomo 重新载入配置时，此更改会重置。

# rules.inspector.temporaryState.title
source: Temporary Runtime State
zh_hans: 临时运行时状态

# rules.inspector.title
source: Rule Details
zh_hans: 规则详情

# rules.inspector.toggleUnavailable
source: Runtime Toggle Unavailable
zh_hans: 运行时切换不可用

# rules.list.count
source: Rules (%lld)
zh_hans: 规则（%lld）

# rules.metrics.autoUpdate
source: Auto Update
zh_hans: 自动更新

# rules.metrics.bypassed
source: Bypassed
zh_hans: 已绕过

# rules.metrics.currentMode
source: Current Mode
zh_hans: 当前模式

# rules.metrics.groups
source: Across %lld groups
zh_hans: 共 %lld 个分组

# rules.metrics.matched
source: Matched
zh_hans: 已匹配

# rules.metrics.mode
source: Rule Mode
zh_hans: 规则模式

# rules.metrics.percentOfTotal
source: %.1f%% of total
zh_hans: 占总数 %.1f%%

# rules.metrics.rule
source: Rule
zh_hans: 规则

# rules.metrics.total
source: Total Rules
zh_hans: 规则总数

# rules.metrics.updated
source: Last Updated
zh_hans: 最近更新

# rules.mode.ruleProviders.description
source: Rule provider updates and health details stay in the Providers section so management controls are not duplicated here.
zh_hans: 规则供应商的更新和健康详情保留在“供应商”中，以免在此重复管理控件。

# rules.mode.ruleProviders.title
source: Rule Providers
zh_hans: 规则供应商

# rules.mode.runtimeRules.title
source: Runtime Rules
zh_hans: 运行时规则

# rules.mode.workbenchSummary.description
source: Rule source layers and editable provenance are available in Configuration Workbench after a profile is selected.
zh_hans: 选择配置后，可在配置工作台中查看规则来源层和可编辑的来源信息。

# rules.mode.workbenchSummary.title
source: Workbench Summary
zh_hans: 工作台摘要

# rules.mutation.applying
source: Applying
zh_hans: 正在应用

# rules.mutation.preparing
source: Preparing
zh_hans: 正在准备

# rules.mutation.rollingBack
source: Rolling Back
zh_hans: 正在回滚

# rules.mutation.verifying
source: Verifying
zh_hans: 正在验证

# rules.pagination.showing
source: Showing
zh_hans: 显示

# rules.phase.configurationApplying.detail
source: The committed rule generation remains visible while Vela loads the already-applied configuration.
zh_hans: Vela 载入已应用的配置期间，仍显示已确认的规则代次。

# rules.phase.configurationApplying.title
source: Applying Configuration
zh_hans: 正在应用配置

# rules.phase.partialFailure.detail
source: The last confirmed runtime rules remain visible; no specific row is claimed to be affected.
zh_hans: 仍显示最后确认的运行时规则；不会声称某条特定规则受到影响。

# rules.phase.partialFailure.title
source: Last Confirmed Rules
zh_hans: 最后确认的规则

# rules.phase.refreshing.title
source: Refreshing Runtime Rules
zh_hans: 正在刷新运行时规则

# rules.phase.stale.title
source: Rules Snapshot May Be Out of Date
zh_hans: 规则快照可能已过期

# rules.phase.temporaryMutation.detail
source: The committed rule stays visible until Mihomo confirms the requested temporary state.
zh_hans: 在 Mihomo 确认请求的临时状态前，仍显示已确认的规则。

# rules.phase.temporaryMutation.targetFormat
source: Rule #%lld · %@
zh_hans: 规则 #%lld · %@

# rules.phase.temporaryMutation.title
source: Applying Temporary Rule Change
zh_hans: 正在应用临时规则更改

# rules.preview.direct
source: Direct
zh_hans: 直连

# rules.preview.internet
source: Internet
zh_hans: 互联网

# rules.preview.proxyGroup
source: Proxy Group
zh_hans: 代理组

# rules.preview.subtitle
source: Traffic flow for this rule
zh_hans: 此规则的流量路径

# rules.preview.thisMac
source: This Mac
zh_hans: 这台 Mac

# rules.preview.title
source: Rule Preview
zh_hans: 规则预览

# rules.preview.unavailable
source: Unavailable
zh_hans: 不可用

# rules.recovery.controllerDisconnected.description
source: Mihomo is running, but its Controller is disconnected. Restore the Controller connection, then reload the rule table.
zh_hans: Mihomo 正在运行，但 Controller 已断开。恢复 Controller 连接后，再重新加载规则表。

# rules.recovery.controllerDisconnected.title
source: Controller Disconnected
zh_hans: Controller 已断开

# rules.recovery.emptyConfiguration.description
source: No configuration is selected, or the active configuration produces no runtime rules. Open Configuration Workbench to choose or edit it.
zh_hans: 尚未选择配置，或当前配置未生成运行时规则。请打开配置工作台进行选择或编辑。

# rules.recovery.mihomoStopped.description
source: Mihomo is not running, so Vela cannot read runtime rules. Start Mihomo, then reload the rule table.
zh_hans: Mihomo 未运行，因此 Vela 无法读取运行时规则。启动 Mihomo 后，再重新加载规则表。

# rules.recovery.mihomoStopped.title
source: Mihomo Is Stopped
zh_hans: Mihomo 已停止

# rules.recovery.ruleFetchFailed.description
source: The Controller is reachable, but it did not return a usable rule snapshot. Reload the rules or open Diagnostics for details.
zh_hans: Controller 可访问，但未返回可用的规则快照。请重新加载规则，或打开诊断查看详情。

# rules.recovery.ruleFetchFailed.title
source: Rules Couldn’t Be Loaded
zh_hans: 无法加载规则

# rules.search.placeholder
source: Search rules or domains…
zh_hans: 搜索规则或域名…

# rules.snapshotAge.detailFormat
source: Showing the committed generation last refreshed %@ ago.
zh_hans: 显示已确认的规则代次，上次刷新于%@前。

# rules.snapshotAge.unavailable
source: The last successful refresh time is unavailable.
zh_hans: 上次成功刷新的时间不可用。

# rules.sort.field.hits
source: Hit Count
zh_hans: 命中次数

# rules.sort.field.index
source: Index
zh_hans: 索引

# rules.sort.field.lastHit
source: Last Hit
zh_hans: 上次命中

# rules.sort.field.payload
source: Payload
zh_hans: 载荷

# rules.sort.field.policy
source: Policy
zh_hans: 策略

# rules.sort.field.type
source: Type
zh_hans: 类型

# rules.source.builtIn
source: Built-in
zh_hans: 内置

# rules.source.configuration
source: Configuration
zh_hans: 配置

# rules.source.global
source: Global
zh_hans: 全局

# rules.source.provider
source: Provider
zh_hans: 供应商

# rules.source.runtimeForced
source: Runtime Forced
zh_hans: 运行时强制

# rules.source.scene
source: Scene
zh_hans: 场景

# rules.source.upstream
source: Upstream
zh_hans: 上游

# rules.status.disabled
source: Disabled
zh_hans: 已停用

# rules.status.enabled
source: Enabled
zh_hans: 已启用

# rules.status.fixed
source: Fixed
zh_hans: 固定

# rules.status.runtimeOnly
source: Runtime only
zh_hans: 仅运行时

# rules.status.temporary
source: Temporary
zh_hans: 临时

# rules.subtitle
source: Traffic rules define how requests are routed
zh_hans: 流量规则决定请求的路由方式

# rules.value.unavailable
source: Unavailable
zh_hans: 不可用

# runtime.backend.systemProxy
source: System Proxy
zh_hans: 系统代理

# runtime.backend.userProcess
source: User Process
zh_hans: 用户进程

# runtime.engineFailure.configurationInvalid
source: The selected configuration is invalid.
zh_hans: 所选配置无效。

# runtime.engineFailure.controllerUnavailable
source: The Mihomo Controller is unavailable.
zh_hans: Mihomo Controller 不可用。

# runtime.engineFailure.coreIntegrityFailed
source: The Mihomo core did not pass integrity checks.
zh_hans: Mihomo 内核未通过完整性检查。

# runtime.engineFailure.executableMissing
source: The Mihomo executable is missing from the app bundle.
zh_hans: 应用包中缺少 Mihomo 可执行文件。

# runtime.engineFailure.executableNotRunnable
source: The bundled Mihomo executable cannot be run.
zh_hans: 内置 Mihomo 可执行文件无法运行。

# runtime.engineFailure.healthCheckFailed
source: The engine health check failed.
zh_hans: 引擎健康检查失败。

# runtime.engineFailure.processLaunchFailed
source: Mihomo could not be launched.
zh_hans: 无法启动 Mihomo。

# runtime.engineFailure.runtimeConfigBuildFailed
source: The runtime configuration could not be generated.
zh_hans: 无法生成运行时配置。

# runtime.engineFailure.stopFailed
source: Mihomo could not be stopped cleanly.
zh_hans: 无法安全停止 Mihomo。

# runtime.engineFailure.systemProxyFailed
source: The System Proxy operation failed.
zh_hans: 系统代理操作失败。

# runtime.engineFailure.unexpectedTerminationFormat
source: Mihomo exited unexpectedly with status %lld.
zh_hans: Mihomo 意外退出，状态码为 %lld。

# runtime.healthIssue.configuration.action
source: Select and validate a configuration before retrying.
zh_hans: 请选择并验证配置，然后重试。

# runtime.healthIssue.configuration.title
source: Configuration needs attention
zh_hans: 配置需要处理

# runtime.healthIssue.controller.action
source: Wait for the Controller to connect, then refresh health.
zh_hans: 请等待 Controller 连接，然后刷新健康状态。

# runtime.healthIssue.controller.title
source: Controller needs attention
zh_hans: Controller 需要处理

# runtime.healthIssue.internet.title
source: Internet check needs attention
zh_hans: 互联网检查需要处理

# runtime.healthIssue.mixedPort.action
source: Check the mixed-port conflict in Diagnostics.
zh_hans: 请在“诊断”中检查混合端口冲突。

# runtime.healthIssue.mixedPort.title
source: Mixed port needs attention
zh_hans: 混合端口需要处理

# runtime.healthIssue.network.action
source: Check the current network connection, then refresh health.
zh_hans: 请检查当前网络连接，然后刷新健康状态。

# runtime.healthIssue.networkPath.title
source: Network path needs attention
zh_hans: 网络路径需要处理

# runtime.healthIssue.process.action
source: Restart Mihomo, then refresh health.
zh_hans: 请重新启动 Mihomo，然后刷新健康状态。

# runtime.healthIssue.process.title
source: Mihomo process needs attention
zh_hans: Mihomo 进程需要处理

# runtime.healthIssue.systemProxy.action
source: Review System Proxy ownership and recovery in Diagnostics.
zh_hans: 请在“诊断”中检查系统代理的所有权与恢复状态。

# runtime.healthIssue.systemProxy.title
source: System Proxy needs attention
zh_hans: 系统代理需要处理

# runtime.helper.connecting
source: Connecting…
zh_hans: 正在连接…

# runtime.helper.damaged
source: Damaged
zh_hans: 已损坏

# runtime.helper.damaged.detail
source: The privileged component is damaged. Reinstall it before enabling TUN.
zh_hans: 特权组件已损坏。请重新安装后再启用 TUN。

# runtime.helper.failed
source: Failed
zh_hans: 失败

# runtime.helper.failed.detail
source: The privileged component operation failed. Open Diagnostics for redacted details.
zh_hans: 特权组件操作失败。请打开“诊断”查看已脱敏的详细信息。

# runtime.helper.needsApproval
source: Needs Approval
zh_hans: 需要批准

# runtime.helper.needsApproval.detail
source: Approve Vela in System Settings > General > Login Items & Extensions.
zh_hans: 请在“系统设置”>“通用”>“登录项与扩展”中批准 Vela。

# runtime.helper.notInstalled
source: Not Installed
zh_hans: 未安装

# runtime.helper.ready
source: Ready
zh_hans: 就绪

# runtime.helper.registering
source: Registering…
zh_hans: 正在注册…

# runtime.helper.uninstalling
source: Uninstalling…
zh_hans: 正在卸载…

# runtime.helper.updateRequired
source: Update Required
zh_hans: 需要更新

# runtime.helper.updateRequired.detail
source: The installed Helper protocol is incompatible with this Vela build.
zh_hans: 已安装 Helper 的协议与此 Vela 版本不兼容。

# runtime.status.unavailable
source: Unavailable
zh_hans: 不可用

# runtime.systemProxy.detail.externalFormat
source: External proxy settings detected on %@.
zh_hans: 在 %@ 上检测到外部代理设置。

# runtime.systemProxy.detail.moreFormat
source: %@ and %lld more
zh_hans: %@，另有 %lld 项

# runtime.systemProxy.detail.partialFormat
source: Proxy settings differ across %@.
zh_hans: %@ 上的代理设置不一致。

# runtime.systemProxy.detail.recoveryDataFormat
source: Vela has recovery data for %@.
zh_hans: Vela 已保存 %@ 的恢复数据。

# runtime.systemProxy.detail.restoreFormat
source: Restore or review %@ before stopping Mihomo.
zh_hans: 停止 Mihomo 前，请恢复或检查 %@。

# runtime.systemProxy.detail.unowned
source: These settings match Vela's port, but Vela does not own their recovery data.
zh_hans: 这些设置与 Vela 的端口一致，但 Vela 不持有其恢复数据。

# runtime.systemProxy.detail.verifiedFormat
source: HTTP, HTTPS, and SOCKS are verified on %@.
zh_hans: 已在 %@ 上验证 HTTP、HTTPS 和 SOCKS。

# runtime.systemProxy.off
source: Off
zh_hans: 关闭

# runtime.systemProxy.offRecoveryPending
source: Off · Recovery pending
zh_hans: 关闭 · 等待恢复

# runtime.systemProxy.onExternal
source: On · External
zh_hans: 开启 · 外部管理

# runtime.systemProxy.onManaged
source: On · Managed by Vela
zh_hans: 开启 · 由 Vela 管理

# runtime.systemProxy.partialNeedsAttention
source: Partial · Needs attention
zh_hans: 部分生效 · 需要处理

# runtime.systemProxy.unavailable
source: Unavailable
zh_hans: 不可用

# runtime.transition.committing
source: Committing…
zh_hans: 正在提交…

# runtime.transition.disablingSystemProxy
source: Disabling System Proxy…
zh_hans: 正在关闭系统代理…

# runtime.transition.failedAtObjectFormat
source: Failed at %@
zh_hans: 在%@阶段失败

# runtime.transition.idle
source: Idle
zh_hans: 空闲

# runtime.transition.phase.committing
source: Committing Transition
zh_hans: 提交切换

# runtime.transition.phase.disablingSystemProxy
source: Disabling System Proxy
zh_hans: 关闭系统代理

# runtime.transition.phase.preparingTarget
source: Preparing and Validating
zh_hans: 准备并验证

# runtime.transition.phase.rollingBack
source: Rolling Back
zh_hans: 正在回滚

# runtime.transition.phase.startingTarget
source: Starting Privileged Backend
zh_hans: 启动特权后端

# runtime.transition.phase.stoppingSource
source: Stopping Current Backend
zh_hans: 停止当前后端

# runtime.transition.phase.verifyingTarget
source: Verifying TUN, Route, and DNS
zh_hans: 验证 TUN、路由和 DNS

# runtime.transition.preparingTarget
source: Preparing target…
zh_hans: 正在准备目标…

# runtime.transition.rollingBack
source: Rolling back…
zh_hans: 正在回滚…

# runtime.transition.startingTarget
source: Starting target backend…
zh_hans: 正在启动目标后端…

# runtime.transition.stoppingSource
source: Stopping current backend…
zh_hans: 正在停止当前后端…

# runtime.transition.verifyingTarget
source: Verifying network…
zh_hans: 正在验证网络…

# scenes.action.activate
source: Activate
zh_hans: 激活

# scenes.action.add
source: Add Scene
zh_hans: 添加场景

# scenes.action.cancel
source: Cancel
zh_hans: 取消

# scenes.action.delete
source: Delete
zh_hans: 删除

# scenes.action.edit
source: Edit
zh_hans: 编辑

# scenes.action.ok
source: OK
zh_hans: 确定

# scenes.action.openDiagnostics
source: Open Diagnostics
zh_hans: 打开诊断

# scenes.action.openRecovery
source: Open Recovery
zh_hans: 打开恢复

# scenes.action.remove
source: Remove
zh_hans: 移除

# scenes.action.save
source: Save
zh_hans: 保存

# scenes.action.test
source: Test Scene
zh_hans: 测试场景

# scenes.active.detail
source: Its profile, configuration layer, backend, mode, and proxy selections were committed together.
zh_hans: 已将其配置、配置层、后端、模式和代理选择作为一个整体提交。

# scenes.active.title
source: This Scene is active
zh_hans: 此场景已激活

# scenes.automatic
source: Automatic
zh_hans: 自动

# scenes.automation.help
source: Evaluate enabled Scenes when the network context changes.
zh_hans: 网络环境变化时评估已启用的场景。

# scenes.automation.off
source: Automatic switching off
zh_hans: 自动切换已关闭

# scenes.automation.on
source: Automatic switching on
zh_hans: 自动切换已开启

# scenes.automation.section
source: Automation
zh_hans: 自动化

# scenes.automation.toggle
source: Automatic Scenes
zh_hans: 自动场景

# scenes.cooldown
source: Cooldown
zh_hans: 冷却时间

# scenes.cooldown.format
source: Cooldown: %lld seconds
zh_hans: 冷却时间：%lld 秒

# scenes.delete.messageFormat
source: Delete “%@”? This cannot be undone.
zh_hans: 删除“%@”？此操作无法撤销。

# scenes.delete.title
source: Delete Scene?
zh_hans: 删除场景？

# scenes.edit.active.help
source: Activate another Scene before editing this one.
zh_hans: 请先激活其他场景，再编辑此场景。

# scenes.editor.title
source: Edit Scene
zh_hans: 编辑场景

# scenes.empty.detail
source: Create a Scene to switch profile, backend, mode, and proxy targets as one safe transaction.
zh_hans: 创建场景，以一次安全事务切换配置、后端、模式和代理目标。

# scenes.empty.title
source: No Scenes
zh_hans: 暂无场景

# scenes.empty.toolbarHelp
source: Use Add Scene in the toolbar to create the first Scene.
zh_hans: 使用工具栏中的“添加场景”创建第一个场景。

# scenes.error.activation.suggestion
source: Review the Scene target and Diagnostics, then try again.
zh_hans: 检查场景目标和诊断信息，然后重试。

# scenes.error.activation.title
source: Scene Could Not Be Activated
zh_hans: 无法激活场景

# scenes.error.automation.title
source: Automatic Scenes Could Not Be Updated
zh_hans: 无法更新自动场景

# scenes.error.delete.title
source: Scene Could Not Be Deleted
zh_hans: 无法删除场景

# scenes.error.deleteActive.message
source: Activate another Scene or stop using this Scene before deleting it.
zh_hans: 请先激活其他场景，或停止使用此场景，然后再将其删除。

# scenes.error.deleteActive.title
source: Active Scene Cannot Be Deleted
zh_hans: 无法删除已激活的场景

# scenes.error.editActive.message
source: Activate another Scene before editing this Scene so the saved definition cannot diverge from the active runtime.
zh_hans: 请先激活其他场景，再编辑此场景，以免保存的定义与当前运行时状态不一致。

# scenes.error.editActive.title
source: Active Scene Cannot Be Edited
zh_hans: 无法编辑当前场景

# scenes.error.load.title
source: Scenes Could Not Be Loaded
zh_hans: 无法加载场景

# scenes.error.repairRequired.message
source: Automatic and manual Scene changes are paused until the previous rollback is repaired.
zh_hans: 上一次回滚修复完成前，自动和手动场景切换均已暂停。

# scenes.error.repairRequired.title
source: Scene Repair Is Required
zh_hans: 需要修复场景

# scenes.error.retry.suggestion
source: Review the Scene and try again.
zh_hans: 检查场景后重试。

# scenes.error.rollback.messageFormat
source: The Scene failed (%@), and Vela could not fully restore the previous runtime (%@).
zh_hans: 场景执行失败（%@），并且 Vela 无法完全恢复此前的运行状态（%@）。

# scenes.error.rollback.title
source: Scene Rollback Needs Repair
zh_hans: 场景回滚需要修复

# scenes.error.save.title
source: Scene Could Not Be Saved
zh_hans: 无法保存场景

# scenes.error.state.committedMessage
source: The runtime changed, but Vela could not save the active Scene record. Scene changes are paused until Diagnostics confirms repair.
zh_hans: 运行时已更改，但 Vela 无法保存当前场景记录。场景更改已暂停，直到诊断确认修复完成。

# scenes.error.state.title
source: Scene State Could Not Be Saved
zh_hans: 无法保存场景状态

# scenes.identity.title
source: Identity
zh_hans: 标识

# scenes.loading
source: Loading Scenes…
zh_hans: 正在加载场景…

# scenes.loading.detail
source: Loading Scene detail…
zh_hans: 正在加载场景详情…

# scenes.manual
source: Manual
zh_hans: 手动

# scenes.manualLock.none
source: Do not pause automation
zh_hans: 不暂停自动化

# scenes.manualLock.secondsFormat
source: %lld seconds after manual activation
zh_hans: 手动激活后 %lld 秒

# scenes.manualLock.thirtyMinutes
source: Pause automation for 30 minutes
zh_hans: 暂停自动化 30 分钟

# scenes.manualLock.title
source: After manual activation
zh_hans: 手动激活后

# scenes.manualLock.untilDisabled
source: Pause until Automatic Scenes is re-enabled
zh_hans: 暂停，直到重新启用“自动场景”

# scenes.manualLock.untilNetworkChange
source: Pause until the network changes
zh_hans: 暂停到网络发生变化

# scenes.manualOnly
source: Manual only · no automatic trigger groups
zh_hans: 仅限手动 · 无自动触发器组

# scenes.matchExplanation.blockedConditions
source: Blocked conditions
zh_hans: 受阻条件

# scenes.matchExplanation.highestPriority
source: Highest-priority match
zh_hans: 最高优先级匹配

# scenes.matchExplanation.lastEvaluated
source: Last evaluated
zh_hans: 上次评估

# scenes.matchExplanation.notRecommended
source: Not currently recommended
zh_hans: 当前不建议使用

# scenes.matchExplanation.outcome
source: Outcome
zh_hans: 结果

# scenes.matchExplanation.priorityResult
source: Priority result
zh_hans: 优先级结果

# scenes.matchExplanation.title
source: Match explanation
zh_hans: 匹配说明

# scenes.missing.fail
source: Fail Scene
zh_hans: 终止场景

# scenes.missing.keepDefault
source: Keep default
zh_hans: 保持默认值

# scenes.missing.warnContinue
source: Warn and continue
zh_hans: 警告并继续

# scenes.mutation.available
source: Available
zh_hans: 可用

# scenes.mutation.busy
source: Another Scene operation is in progress.
zh_hans: 另一项场景操作正在进行。

# scenes.mutation.repair
source: Open Recovery and confirm a safe runtime before changing Scenes.
zh_hans: 更改场景前，请打开恢复并确认运行时安全。

# scenes.name
source: Name
zh_hans: 名称

# scenes.outcome.alreadyActive
source: Already active
zh_hans: 已经激活

# scenes.outcome.cooldown
source: Cooldown active
zh_hans: 冷却期生效中

# scenes.outcome.draftPending
source: Configuration draft pending
zh_hans: 配置草稿待处理

# scenes.outcome.manualLock
source: Manual lock active
zh_hans: 手动锁定生效中

# scenes.outcome.noMatch
source: No matching Scene
zh_hans: 没有匹配的场景

# scenes.outcome.repairRequired
source: Repair required
zh_hans: 需要修复

# scenes.outcome.selected
source: Selected for activation
zh_hans: 已选择激活

# scenes.permission.wifi.detail
source: Only Wi-Fi/SSID automatic conditions are blocked. Manual, wired, time, and power Scenes remain available. Review Location Services for Vela in System Settings.
zh_hans: 只有 Wi-Fi/SSID 自动条件受阻。手动、有线、时间和电源场景仍然可用。请在系统设置中检查 Vela 的定位服务。

# scenes.permission.wifi.title
source: Wi-Fi trigger permission required
zh_hans: Wi-Fi 触发器需要权限

# scenes.priority
source: Priority
zh_hans: 优先级

# scenes.priority.format
source: Priority: %lld
zh_hans: 优先级：%lld

# scenes.proxySelections.add
source: Add Proxy Selection
zh_hans: 添加代理选择

# scenes.proxySelections.empty
source: Keep the profile’s default proxy selections.
zh_hans: 保留配置的默认代理选择。

# scenes.proxySelections.group
source: Group
zh_hans: 代理组

# scenes.proxySelections.missingPolicy
source: If unavailable
zh_hans: 不可用时

# scenes.proxySelections.proxy
source: Proxy
zh_hans: 代理

# scenes.proxySelections.title
source: Proxy selections
zh_hans: 代理选择

# scenes.repair.detail
source: The last rollback could not be proved complete. Automatic switching stays off until Diagnostics confirms repair.
zh_hans: 无法确认上一次回滚已完整完成。自动切换将保持关闭，直到诊断确认修复完成。

# scenes.repair.title
source: Scene changes are paused
zh_hans: 场景切换已暂停

# scenes.rollback.contextFormat
source: Committed Scene: %@ · Observed backend: %@ · Mode: %@ · Reason: %@. Automatic and manual Scene mutations remain paused.
zh_hans: 已提交场景：%@ · 观测到的后端：%@ · 模式：%@ · 原因：%@。自动和手动场景更改仍处于暂停状态。

# scenes.rollback.repairTitle
source: Scene rollback needs repair
zh_hans: 场景回滚需要修复

# scenes.row.triggerCountFormat
source: %lld trigger groups
zh_hans: %lld 个触发器组

# scenes.runtime.activeBackend
source: Active backend
zh_hans: 活动后端

# scenes.runtime.title
source: Observed runtime
zh_hans: 观测到的运行时

# scenes.seconds.format
source: %lld seconds
zh_hans: %lld 秒

# scenes.select.detail
source: Choose a Scene to review its target, triggers, and activation status.
zh_hans: 选择一个场景以查看其目标、触发器和激活状态。

# scenes.select.title
source: Select a Scene
zh_hans: 选择场景

# scenes.status.active
source: Active
zh_hans: 已激活

# scenes.status.autoMatch
source: Auto-match
zh_hans: 自动匹配

# scenes.status.blocked
source: Blocked
zh_hans: 受阻

# scenes.status.disabled
source: Disabled
zh_hans: 已停用

# scenes.status.enabled
source: Enabled
zh_hans: 已启用

# scenes.status.requested
source: Requested
zh_hans: 已请求

# scenes.subtitle
source: Network contexts and safe runtime targets
zh_hans: 网络环境与安全运行目标

# scenes.summary.automaticOff
source: Automatic off
zh_hans: 自动切换已关闭

# scenes.summary.automaticOn
source: Automatic on
zh_hans: 自动切换已开启

# scenes.summary.countFormat
source: %lld scenes
zh_hans: %lld 个场景

# scenes.summary.format
source: %@ · %@ active · %@
zh_hans: %@ · %@ 已激活 · %@

# scenes.target.backend
source: Backend
zh_hans: 后端

# scenes.target.configurationLayer
source: Configuration layer
zh_hans: 配置层

# scenes.target.mode
source: Mihomo mode
zh_hans: Mihomo 模式

# scenes.target.profile
source: Profile
zh_hans: 配置

# scenes.target.title
source: Target
zh_hans: 目标

# scenes.test.blocked
source: Scene is blocked
zh_hans: 场景已被阻止
